app/views/topics/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  ORDER BY created_at DESC  [["topic_id", 2]]
---
 <!-- #10 -->
     <% @topic.posts.each do |post| %>