app/controllers/posts_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "posts" ("title", "body", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Heyos"], ["body", "laksdfja;lvn;asdjlfhaskljndclaksjdfnlkajsdhf"], ["topic_id", 5], ["created_at", "2017-04-19 15:45:22.016085"], ["updated_at", "2017-04-19 15:45:22.016085"]]
---
  def create
    @post = Post.new
    @post.title = params[:post][:title]
    @post.body = params[:post][:body]
    @topic = Topic.find(params[:topic_id])
    @post.topic = @topic

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 11]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Edit edit edit"], ["body", "Today I EDIT"], ["updated_at", "2017-04-17 23:22:37.568452"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.title = params[:post][:title]
    @post.body = params[:post][:body]

    if @post.save