app/controllers/topics_controller.rb

   def create
     @topic = Topic.new(topic_params)

     if @topic.save
---
INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "New"], ["description", "NEWEWEW"], ["created_at", "2017-04-18 21:40:41.199837"], ["updated_at", "2017-04-18 21:40:41.199837"]]

  def update
   @topic = Topic.find(params[:id])

   @topic.assign_attributes(topic_params)

   if @topic.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["name", "Testing this out"], ["description", "Hey mom, how is it going?"], ["updated_at", "2017-04-18 22:04:50.734813"], ["id", 4]]